5.Resources/Hall_Implementation_openFOAM/Z4curvedlookuptable/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application directory
application=`getApplication`

runApplication blockMesh

#- Run serial
#runApplication $application

#- Run parallel
runApplication decomposePar -cellDist
runParallel $application
runApplication reconstructPar

runApplication postChannel

#------------------------------------------------------------------------------
