5.Resources/Hall_Implementation_openFOAM/Z4curvedlookuptable/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    cyclic1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          200;
        startFace       7780;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  cyclic2;
    }
    cyclic2
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          200;
        startFace       7980;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  cyclic1;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          8000;
        startFace       8180;
    }
    outlet
    {
        type            patch;
        nFaces          20;
        startFace       16180;
    }
    inlet
    {
        type            patch;
        nFaces          20;
        startFace       16200;
    }
)

// ************************************************************************* //
